fonecmid-diplom/src/DataProcessors/ВКМ_Календарь/ВКМ_Календарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_Календарь</name>
  <attributes>
    <name>Планировщик</name>
    <type>
      <types>Planner</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

fonecmid-diplom/src/Enums/ВКМ_КатегорияФизическогоЛица/ВКМ_КатегорияФизическогоЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_КатегорияФизическогоЛица</name>
  <enumValues>
    <name>Специалист</name>
  </enumValues>
  <enumValues>
    <name>АдминистративныйПерсонал</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/ВКМ_Календарь/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаПроведенияРабот = ТекущаяДатаСеанса();
	ИнициализироватьНастройкиПланировщика();
		
	ИнициализироватьИзмеренияПланировщика();   
  	ЗаполнитьЭлементыПланировщика(ДатаПроведенияРабот);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ВКМ_ОбслуживаниеКлиента" Тогда
		ИнициализироватьИзмеренияПланировщика();   
  		ЗаполнитьЭлементыПланировщика(ДатаПроведенияРабот);
	КонецЕсли;

КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы


&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ДатаПроведенияРабот", НачалоДня(Начало));
	ЗначенияЗаполнения.Вставить("ВремяНачалаРабот", Дата('00010101') + (Начало-НачалоДня(Начало)));	
	ЗначенияЗаполнения.Вставить("ВремяОкончанияРабот", Дата('00010101') + (Конец-НачалоДня(Конец)));
	ЗначенияЗаполнения.Вставить("Специалист", ЗначенияИзмерений.Получить("Специалисты"));
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.ФормаОбъекта", ПараметрыФормы);
			
КонецПроцедуры


&НаКлиенте
Процедура ПланировщикПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Элемент.ВыделенныеЭлементы[0].Значение);
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.ФормаОбъекта", ПараметрыФормы);
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.Форма.ФормаДокумента", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроведенияРаботПриИзменении(Элемент)   
  	ЗаполнитьЭлементыПланировщика(ДатаПроведенияРабот);
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДатаПроведенияРабот = ТекущиеПериодыОтображения[0].Начало;
  	ЗаполнитьЭлементыПланировщика(ДатаПроведенияРабот);
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Обновить(Команда)
	ИнициализироватьИзмеренияПланировщика();   
  	ЗаполнитьЭлементыПланировщика(ДатаПроведенияРабот);
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьНастройкиПланировщика()
	Объект.Планировщик.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Час;
	Объект.Планировщик.КратностьПериодическогоВарианта = 24;
	Объект.Планировщик.ОтступСНачалаПереносаШкалыВремени = 8;
	Объект.Планировщик.ОтступСКонцаПереносаШкалыВремени = 4;
	
	ШкалаВремени = Объект.Планировщик.ШкалаВремени.Элементы[0];
	ШкалаВремени.Единица = ТипЕдиницыШкалыВремени.Минута;
	ШкалаВремени.Кратность = 30;
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьИзмеренияПланировщика()

	ИзмеренияПланировщика   = Объект.Планировщик.Измерения;
    ИзмеренияПланировщика.Очистить();    
    ИзмерениеСпециалисты = ИзмеренияПланировщика.Добавить("Специалисты");   
    Запрос = Новый Запрос;
    Запрос.Текст =
    	"ВЫБРАТЬ
    	|	ВКМ_ФизическиеЛица.Ссылка,
    	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВКМ_ФизическиеЛица.Наименование) КАК Наименование
    	|ИЗ
    	|	Справочник.ВКМ_ФизическиеЛица КАК ВКМ_ФизическиеЛица
    	|ГДЕ
    	|	ВКМ_ФизическиеЛица.Категория = ЗНАЧЕНИЕ(Перечисление.ВКМ_КатегорияФизическогоЛица.Специалист)";
    
    РезультатЗапроса = Запрос.Выполнить();
    ВыборкаСпециалисты = РезультатЗапроса.Выбрать();
    
    Пока ВыборкаСпециалисты.Следующий() Цикл
        НовыйСпециалист = ИзмерениеСпециалисты.Элементы.Добавить(ВыборкаСпециалисты.Ссылка);
        НовыйСпециалист.Текст = ВыборкаСпециалисты.Наименование;
    КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЭлементыПланировщика(ДатаПланировщика)
	НачалоРабочегоДня = НачалоДня(ДатаПланировщика);
	КонецРабочегоДня = КонецДня(ДатаПланировщика);
	Объект.Планировщик.ТекущиеПериодыОтображения.Очистить();
	Объект.Планировщик.ТекущиеПериодыОтображения.Добавить(НачалоРабочегоДня, КонецРабочегоДня);
	Объект.Планировщик.Элементы.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка,
		|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРабот,
		|	НАЧАЛОПЕРИОДА(ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот, ДЕНЬ) КАК ДатаПроведенияРабот,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВКМ_ОбслуживаниеКлиента.Специалист) КАК ПредставлениеСпециалист,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВКМ_ОбслуживаниеКлиента.Ссылка) КАК ПредставлениеДокумента,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВКМ_ОбслуживаниеКлиента.Договор) КАК Договор,
		|	ВКМ_ОбслуживаниеКлиента.ОписаниеПроблемы,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВКМ_ОбслуживаниеКлиента.Клиент) КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиента.Специалист,
		|	ВКМ_ОбслуживаниеКлиента.Специалист.Ссылка
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоРабочегоДня);
	Запрос.УстановитьПараметр("КонецПериода", КонецРабочегоДня);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СоответствиеЗначений = Новый Соответствие;
        СоответствиеЗначений.Вставить("Специалисты",   Выборка.Специалист);
		НачалоОбслуживания = Выборка.ДатаПроведенияРабот + (Выборка.ВремяНачалаРабот - Дата(1,1,1));
		КонецОбслуживания = Выборка.ДатаПроведенияРабот + (Выборка.ВремяОкончанияРабот - Дата(1,1,1));		
		ЭлементПланировщика = Объект.Планировщик.Элементы.Добавить(НачалоОбслуживания, КонецОбслуживания);
		ЭлементПланировщика.ЗначенияИзмерений  = Новый ФиксированноеСоответствие(СоответствиеЗначений);
		ЭлементПланировщика.Значение = Выборка.Ссылка;
		ЭлементПланировщика.Текст = Выборка.Клиент;
		ЭлементПланировщика.Подсказка = СтрШаблон("%1
		|Специалист: %2
		|Клиент: %3
		|Договор: %4
		|Дата проведения работ: %5
		|Время проведения работ: %6 - %7
		|Описание проблемы: %8
		|", Выборка.ПредставлениеДокумента, Выборка.ПредставлениеСпециалист, 
		Выборка.Клиент, Выборка.Договор, Формат(Выборка.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"),
		Формат(Выборка.ВремяНачалаРабот, "ДФ=HH:mm;"), Формат(Выборка.ВремяОкончанияРабот, "ДФ=HH:mm;"),
		Выборка.ОписаниеПроблемы);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
